hetida4office/hetida4office/edge/co2sensor/firmware/nRF5_SDK_for_Thread_and_Zigbee_v4.1.0_32ce5f8/components/thread/mqtt_sn/mqtt_sn_client/mqttsn_packet_receiver.c
/**
 * Copyright (c) 2017 - 2020, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

#include "MQTTSNPacket.h"
#include "mqttsn_packet_internal.h"
#include "mqttsn_platform.h"
#include "mem_manager.h"
#include "nrf_assert.h"
#include "nrf_error.h"
#include "nrf_log.h"
#include <string.h>

#define MQTTSN_PACKET_PINGREQ_LENGTH 2

/**@brief PINGREQ message buffer. */
static uint8_t mp_pingreq_msg[MQTTSN_PACKET_PINGREQ_LENGTH + MQTTSN_CLIENT_ID_MAX_LENGTH];

uint32_t mqttsn_packet_msgtype_index_get(const uint8_t * p_buffer)
{
    if (p_buffer[0] == MQTTSN_TWO_BYTE_LENGTH_CODE)
    {
        return MQTTSN_OFFSET_TWO_BYTE_LENGTH;
    }
    else
    {
        return MQTTSN_OFFSET_ONE_BYTE_LENGTH;
    }
}

mqttsn_ack_error_t mqttsn_packet_msgtype_error_get(const uint8_t * p_buffer)
{
    uint32_t msg_type = p_buffer[mqttsn_packet_msgtype_index_get(p_buffer)];
    
    switch (msg_type)
    {
        case 0x04:
        case 0x05:
            return MQTTSN_PACKET_CONNACK;

        case 0x0a:
        case 0x0b:
            return MQTTSN_PACKET_REGACK;

        case 0x0c:
        case 0x0d:
            return MQTTSN_PACKET_PUBACK;

        case 0x12:
        case 0x13:
            return MQTTSN_PACKET_SUBACK;

        case 0x14:
        case 0x15:
            return MQTTSN_PACKET_UNSUBACK;

        case 0x16:
        case 0x17:
            return MQTTSN_PACKET_PINGREQ;

        case 0x18: // Disconnect response equals disconnect request.
            return MQTTSN_PACKET_DISCONNECT;

        case 0x1a:
        case 0x1b:
            return MQTTSN_PACKET_WILLTOPICUPD;

        case 0x1c:
        case 0x1d:
            return MQTTSN_PACKET_WILLMSGUPD;

        default:
            return MQTTSN_PACKET_INCORRECT;
    }
}

/**@brief Creates keep-alive PINGREQ packet.  
 *
 * @param[inout] p_client Pointer to an MQTT-SN client instance. 
 */
static void pingreq_packet_create(mqttsn_client_t * p_client)
{
    MQTTSNString client_id = MQTTSNString_initializer;
    client_id.cstring      = nrf_malloc(MQTTSN_CLIENT_ID_MAX_LENGTH);
    if (client_id.cstring == NULL)
    {
        return;
    }

    memset(client_id.cstring, 0, MQTTSN_CLIENT_ID_MAX_LENGTH);
    memcpy(client_id.cstring, p_client->connect_info.p_client_id, p_client->connect_info.client_id_len);
    uint16_t pingreq_len = MQTTSN_PACKET_PINGREQ_LENGTH + p_client->connect_info.client_id_len;
    uint16_t datalen     = MQTTSNSerialize_pingreq(mp_pingreq_msg, pingreq_len, client_id);
    if (datalen == 0)
    {
        nrf_free(client_id.cstring);
        return;
    }
    
    p_client->keep_alive.message.retransmission_cnt = MQTTSN_DEFAULT_RETRANSMISSION_CNT + 1;
    p_client->keep_alive.message.p_data             = mp_pingreq_msg;
    p_client->keep_alive.message.len                = datalen;

    nrf_free(client_id.cstring);
}

/**@brief Handles GWINFO message received from the gateway. 
 *
 * @note Unless client is searching for gateway, GWINFO message is ignored.
 *
 * @param[inout] p_client    Pointer to an MQTT-SN client instance.
 * @param[in]    p_remote    Pointer to remote endpoint - the gateway's address.
 * @param[in]    p_data      Received data.
 * @param[in]    datalen     Length of the received data.
 *
 * @retval       NRF_SUCCESS In all cases.
 */
static uint32_t gwinfo_handle(mqttsn_client_t        * p_client,
                              const mqttsn_remote_t  * p_remote,
                              const uint8_t          * p_data,
                              uint16_t                 datalen)
{
    if (p_client->gateway_discovery.pending)
    {
        mqttsn_event_t evt;
        memset(&evt, 0, sizeof(mqttsn_event_t));
        evt.event_id                            = MQTTSN_EVENT_GATEWAY_FOUND;
        evt.event_data.connected.gateway_id     = p_data[MQTTSN_OFFSET_GATEWAY_INFO_ID];
        evt.event_data.connected.p_gateway_addr = (mqttsn_remote_t *)p_remote;

        p_client->gateway_discovery.found = true;

        p_client->evt_handler(p_client, &evt);
    }

    return NRF_SUCCESS;
}

/**@brief Handles WILLTOPICREQ message received from the gateway.  
 *
 * @param[inout] p_client Pointer to an MQTT-SN client instance. 
 */
static uint32_t willtopicreq_handle(mqttsn_client_t * p_client)
{
    return mqttsn_packet_sender_willtopic(p_client);
}

