hetida4office/hetida4office/edge/co2sensor/firmware/nRF5_SDK_for_Thread_and_Zigbee_v4.1.0_32ce5f8/components/thread/mqtt_sn/mqtt_sn_client/mqttsn_packet_receiver.c
/**@brief Handles WILLMSGREQ message received from the gateway.  
 *
 * @param[inout] p_client Pointer to an MQTT-SN client instance. 
 */
static uint32_t willmsgreq_handle(mqttsn_client_t * p_client)
{
    return mqttsn_packet_sender_willmsg(p_client);
}

/**@brief Handles CONNACK message received from the gateway.  
 *
 * @param[inout] p_client    Pointer to an MQTT-SN client instance. 
 * @param[in]    p_data      Received data.
 * @param[in]    datalen     Length of the received data.
 *
 * @retval       NRF_SUCCESS        If CONNECT message was accepted or rejected due to congestion
 *                                  and processed successfully.
 * @retval       NRF_ERROR_INTERNAL Otherwise.
 */
static uint32_t connack_handle(mqttsn_client_t * p_client,
                               const uint8_t   * p_data,
                               uint16_t          datalen)
{
    uint32_t return_code = 0;

    if (p_client->client_state != MQTTSN_CLIENT_ESTABLISHING_CONNECTION)
    {
        NRF_LOG_ERROR("CONNACK packet was not expected.\r\n");
        return NRF_ERROR_INTERNAL;
    }

    if (MQTTSNDeserialize_connack((int *)(&return_code), (unsigned char *)(p_data), datalen) == 0)
    {
        NRF_LOG_ERROR("CONNACK packet cannot be deserialized.\r\n");
        return NRF_ERROR_INTERNAL;
    }

    switch (return_code)
    {
        case MQTTSN_RC_ACCEPTED:
        {
            uint32_t fifo_dequeue_rc = mqttsn_packet_fifo_elem_dequeue(p_client,
                                                                       MQTTSN_MSGTYPE_CONNECT,
                                                                       MQTTSN_MESSAGE_TYPE);
            ASSERT(fifo_dequeue_rc == NRF_SUCCESS);
        
            pingreq_packet_create(p_client);
            p_client->keep_alive.duration = p_client->connect_info.alive_duration * 1000;
            p_client->keep_alive.timeout  = mqttsn_platform_timer_set_in_ms(p_client->keep_alive.duration);
       
            if (mqttsn_client_timeout_schedule(p_client) != NRF_SUCCESS)
            {
                NRF_LOG_ERROR("Keep alive message could not be scheduled.\r\n");
                return NRF_ERROR_INTERNAL;
            }

            mqttsn_client_state_update(p_client, RECEIVED_CONNACK);

            mqttsn_event_t evt_rc =
            {
                .event_id = MQTTSN_EVENT_CONNECTED
            };
            p_client->evt_handler(p_client, &evt_rc);

            return NRF_SUCCESS;
        }

        case MQTTSN_RC_REJECTED_CONGESTED:
        {
            NRF_LOG_INFO("Connect message was rejected. Reason: congestion.\r\n");

            uint32_t fifo_dequeue_rc = mqttsn_packet_fifo_elem_dequeue(p_client,
                                                                       MQTTSN_MSGTYPE_CONNECT,
                                                                       MQTTSN_MESSAGE_TYPE);
            ASSERT(fifo_dequeue_rc == NRF_SUCCESS);

            mqttsn_event_t evt_rc;
            memset(&evt_rc, 0, sizeof(mqttsn_event_t));
            evt_rc.event_id                  = MQTTSN_EVENT_TIMEOUT;
            evt_rc.event_data.error.error    = MQTTSN_ERROR_REJECTED_CONGESTION;
            evt_rc.event_data.error.msg_type = mqttsn_packet_msgtype_error_get(p_data);
            evt_rc.event_data.error.msg_id   = 0;

            p_client->evt_handler(p_client, &evt_rc);

            return NRF_SUCCESS;
        }

        default:
            NRF_LOG_ERROR("Connect message was rejected. Reason: %d\r\n", return_code);
            return NRF_ERROR_INTERNAL;
    }
}

/**@brief Handles REGISTER message received from the gateway.  
 *
 * @param[inout] p_client    Pointer to an MQTT-SN client instance. 
 * @param[in]    p_data      Received data.
 * @param[in]    datalen     Length of the received data.
 *
 * @retval       NRF_SUCCESS        If REGACK message was sent successfully in response.
 * @retval       NRF_ERROR_INTERNAL Otherwise.
 */
static uint32_t register_handle(mqttsn_client_t * p_client,
                                const uint8_t   * p_data,
                                uint16_t          datalen)
{
    uint32_t err_code  = NRF_ERROR_INVALID_STATE;
    uint16_t packet_id = 0;
    uint16_t topic_id  = 0;
    MQTTSNString ret_topic;

    if (MQTTSNDeserialize_register(&topic_id, &packet_id, &ret_topic, (unsigned char *)p_data, datalen) == 0)
    {
        NRF_LOG_ERROR("REGISTER packet cannot be deserialized\r\n");
        return NRF_ERROR_INTERNAL;
    }

    err_code = mqttsn_packet_sender_regack(p_client, topic_id, packet_id, MQTTSN_RC_ACCEPTED);

    mqttsn_topic_t topic;
    memset(&topic, 0, sizeof(mqttsn_topic_t));
    topic.topic_id     = topic_id;
    topic.p_topic_name = (unsigned char *)ret_topic.cstring;

    mqttsn_event_t evt;
    memset(&evt, 0, sizeof(mqttsn_event_t));
    evt.event_id                           = MQTTSN_EVENT_REGISTER_RECEIVED;
    evt.event_data.registered.packet.id    = packet_id;
    evt.event_data.registered.packet.topic = topic;

    p_client->evt_handler(p_client, &evt);

    return err_code;
}

/**@brief Handles REGACK message received from the gateway.  
 *
 * @param[inout] p_client    Pointer to an MQTT-SN client instance. 
 * @param[in]    p_data      Received data.
 * @param[in]    datalen     Length of the received data.
 *
 * @retval       NRF_SUCCESS        If REGISTER message was accepted or rejected due to congestion
 *                                  and processed successfully.
 * @retval       NRF_ERROR_INTERNAL Otherwise.
 */
static uint32_t regack_handle(mqttsn_client_t * p_client,
                              const uint8_t   * p_data,
                              uint16_t          datalen)
{
    uint16_t topic_id    = 0;
    uint16_t packet_id   = 0;
    uint8_t  return_code = 0;
    uint32_t index       = 0;

    if (MQTTSNDeserialize_regack(&topic_id,
                                 &packet_id,
                                 (unsigned char *)(&return_code),
                                 (unsigned char *)p_data,
                                 datalen) == 0)
    {
        NRF_LOG_ERROR("REGACK packet cannot be deserialized.\r\n");
        return NRF_ERROR_INTERNAL;
    }

    switch (return_code)
    {
        case MQTTSN_RC_REJECTED_CONGESTED:
        {
            NRF_LOG_INFO("Register message was rejected. Reason: congestion.\r\n");

            uint32_t fifo_dequeue_rc = mqttsn_packet_fifo_elem_dequeue(p_client, packet_id, MQTTSN_MESSAGE_ID);
            ASSERT(fifo_dequeue_rc == NRF_SUCCESS);

            mqttsn_event_t evt_rc;
            memset(&evt_rc, 0, sizeof(mqttsn_event_t));
            evt_rc.event_id                  = MQTTSN_EVENT_TIMEOUT;
            evt_rc.event_data.error.error    = MQTTSN_ERROR_REJECTED_CONGESTION;
            evt_rc.event_data.error.msg_type = mqttsn_packet_msgtype_error_get(p_data);
            evt_rc.event_data.error.msg_id   = 0;

            p_client->evt_handler(p_client, &evt_rc);

            return NRF_SUCCESS;
        }

        case MQTTSN_RC_ACCEPTED:
        {
            index = mqttsn_packet_fifo_elem_find(p_client, packet_id, MQTTSN_MESSAGE_ID);
            if (index == MQTTSN_PACKET_FIFO_MAX_LENGTH)
            {
                NRF_LOG_ERROR("REGACK packet ID had unexpected value.\r\n");
                return NRF_ERROR_INTERNAL;
            }

            mqttsn_topic_t topic;
            memset(&topic, 0, sizeof(mqttsn_topic_t));
            topic.topic_id     = topic_id;
            topic.p_topic_name = p_client->packet_queue.packet[index].topic.p_topic_name;

            uint32_t fifo_dequeue_rc = mqttsn_packet_fifo_elem_dequeue(p_client, packet_id, MQTTSN_MESSAGE_ID);
            ASSERT(fifo_dequeue_rc == NRF_SUCCESS);

