hetida4office/hetida4office/edge/co2sensor/firmware/nRF5_SDK_for_Thread_and_Zigbee_v4.1.0_32ce5f8/components/thread/mqtt_sn/mqtt_sn_client/mqttsn_packet_receiver.c
            mqttsn_event_t evt_acc;
            memset(&evt_acc, 0, sizeof(mqttsn_event_t));
            evt_acc.event_id                           = MQTTSN_EVENT_REGISTERED;
            evt_acc.event_data.registered.packet.id    = packet_id;
            evt_acc.event_data.registered.packet.topic = topic;

            p_client->evt_handler(p_client, &evt_acc);

            return NRF_SUCCESS;
        }
            
        default:
            NRF_LOG_ERROR("Register message was rejected. Reason: %d\r\n", return_code);
            return NRF_ERROR_INTERNAL;
    }
}

/**@brief Handles PUBLISH message received from the gateway.  
 *
 * @param[inout] p_client    Pointer to an MQTT-SN client instance. 
 * @param[in]    p_data      Received data.
 * @param[in]    datalen     Length of the received data.
 *
 * @retval       NRF_SUCCESS        If the message is processed successfully and (valid for QoS > 0)
 *                                  PUBACK message was sent successfully in response.
 * @retval       NRF_ERROR_INTERNAL Otherwise.
 */
static uint32_t publish_handle(mqttsn_client_t * p_client,
                               const uint8_t   * p_data,
                               uint16_t          datalen)
{
    uint32_t  err_code    = NRF_SUCCESS;
    uint16_t  packet_id   = 0;
    uint32_t  payload_len = 0;
    uint8_t   qos         = 0;
    uint8_t   dup         = 0;
    uint8_t   retained    = 0;
    uint8_t * p_payload;
    MQTTSN_topicid ret_topic;

    if (MQTTSNDeserialize_publish(&dup,
                                  (int *)(&qos),
                                  &retained,
                                  (short unsigned int *)(&packet_id),
                                  &ret_topic,
                                  &p_payload,
                                  (int *)(&payload_len),
                                  (unsigned char *)p_data,
                                  datalen) == 0)
    {
        NRF_LOG_ERROR("PUBLISH packet cannot be deserialized.\r\n");
        return NRF_ERROR_INTERNAL;
    }

    if (qos > 0)
    {
        err_code = mqttsn_packet_sender_puback(p_client, ret_topic.data.id, packet_id, MQTTSN_RC_ACCEPTED);
    }

    mqttsn_topic_t topic = { .topic_id = ret_topic.data.id };

    mqttsn_event_t evt;
    memset(&evt, 0, sizeof(mqttsn_event_t));
    evt.event_id                          = MQTTSN_EVENT_RECEIVED;
    evt.event_data.published.packet.id    = packet_id;
    evt.event_data.published.packet.topic = topic;
    evt.event_data.published.p_payload    = p_payload;

    p_client->evt_handler(p_client, &evt);

    return err_code;
}

/**@brief Handles PUBACK message received from the gateway.  
 *
 * @param[inout] p_client    Pointer to an MQTT-SN client instance. 
 * @param[in]    p_data      Received data.
 * @param[in]    datalen     Length of the received data.
 *
 * @retval       NRF_SUCCESS        If PUBLISH message was accepted or rejected due to congestion
 *                                  and processed successfully.
 * @retval       NRF_ERROR_INTERNAL Otherwise.
 */
static uint32_t puback_handle(mqttsn_client_t * p_client,
                              const uint8_t   * p_data,
                              uint16_t          datalen)
{
    uint16_t topic_id    = 0;
    uint16_t packet_id   = 0;
    uint8_t  return_code = 0;

    if (MQTTSNDeserialize_puback(&topic_id,
                                 &packet_id,
                                 (unsigned char *)(&return_code),
                                 (unsigned char *)(p_data),
                                 datalen) == 0)
    {
        NRF_LOG_ERROR("PUBACK packet cannot be deserialized.\r\n");
        return NRF_ERROR_INTERNAL;
    }

    switch (return_code)
    {
        case MQTTSN_RC_REJECTED_CONGESTED:
        {
            NRF_LOG_INFO("Publish message was rejected. Reason: congestion.\r\n");

            uint32_t fifo_dequeue_rc = mqttsn_packet_fifo_elem_dequeue(p_client, packet_id, MQTTSN_MESSAGE_ID);
            ASSERT(fifo_dequeue_rc == NRF_SUCCESS);

            mqttsn_event_t evt_rc;
            memset(&evt_rc, 0, sizeof(mqttsn_event_t)); 
            evt_rc.event_id                  = MQTTSN_EVENT_TIMEOUT;
            evt_rc.event_data.error.error    = MQTTSN_ERROR_REJECTED_CONGESTION;
            evt_rc.event_data.error.msg_type = mqttsn_packet_msgtype_error_get(p_data);
            evt_rc.event_data.error.msg_id   = 0;

            p_client->evt_handler(p_client, &evt_rc);

            return NRF_SUCCESS;
        }

        case MQTTSN_RC_REJECTED_INVALID_TOPIC_ID:
        {
            NRF_LOG_INFO("Publish message was rejected. Reason: invalid topic id.\r\n");

            uint32_t fifo_dequeue_rc = mqttsn_packet_fifo_elem_dequeue(p_client, packet_id, MQTTSN_MESSAGE_ID);
            ASSERT(fifo_dequeue_rc == NRF_SUCCESS);

            mqttsn_event_t evt_rc;
            memset(&evt_rc, 0, sizeof(mqttsn_event_t)); 
            evt_rc.event_id                  = MQTTSN_EVENT_TIMEOUT;
            evt_rc.event_data.error.error    = MQTTSN_ERROR_REJECTED_INVALID_TOPIC;
            evt_rc.event_data.error.msg_type = mqttsn_packet_msgtype_error_get(p_data);
            evt_rc.event_data.error.msg_id   = 0;

            p_client->evt_handler(p_client, &evt_rc);

            return NRF_SUCCESS;
        }

        case MQTTSN_RC_ACCEPTED:
        {
            if (mqttsn_packet_fifo_elem_find(p_client, packet_id, MQTTSN_MESSAGE_ID) == MQTTSN_PACKET_FIFO_MAX_LENGTH)
            {
                NRF_LOG_ERROR("PUBACK packet ID has unexpected value.\r\n");
                return NRF_ERROR_INTERNAL;
            }
    
            uint32_t fifo_dequeue_rc = mqttsn_packet_fifo_elem_dequeue(p_client, packet_id, MQTTSN_MESSAGE_ID) ;
            ASSERT(fifo_dequeue_rc == NRF_SUCCESS);

            mqttsn_event_t evt_acc =
            {
                .event_id = MQTTSN_EVENT_PUBLISHED
            };
            p_client->evt_handler(p_client, &evt_acc);

            return NRF_SUCCESS;
        }

        default:
            NRF_LOG_ERROR("Publish message was rejected. Reason: %d\r\n", return_code);
            return NRF_ERROR_INTERNAL;
    }
}

