hetida4office/hetida4office/edge/co2sensor/firmware/nRF5_SDK_for_Thread_and_Zigbee_v4.1.0_32ce5f8/components/thread/mqtt_sn/mqtt_sn_client/mqttsn_packet_receiver.c
/**@brief Handles SUBACK message received from the gateway.  
 *
 * @param[inout] p_client    Pointer to an MQTT-SN client instance. 
 * @param[in]    p_data      Received data.
 * @param[in]    datalen     Length of the received data.
 *
 * @retval       NRF_SUCCESS        If SUBSCRIBE message was accepted or rejected due to congestion
 *                                  and processed successfully.
 * @retval       NRF_ERROR_INTERNAL Otherwise.
 */
static uint32_t suback_handle(mqttsn_client_t * p_client,
                              const uint8_t   * p_data,
                              uint16_t          datalen)
{
    uint16_t topic_id    = 0;
    uint16_t packet_id   = 0;
    uint8_t  return_code = 0;
    uint8_t  qos         = 0;

    if (MQTTSNDeserialize_suback((int *)(&qos),
                                 &topic_id,
                                 &packet_id,
                                 (unsigned char *)(&return_code),
                                 (unsigned char *)p_data,
                                 datalen) == 0)
    {
        NRF_LOG_ERROR("SUBACK packet cannot be deserialized.\r\n");
        return NRF_ERROR_INTERNAL;
    }

    switch (return_code)
    {
        case MQTTSN_RC_REJECTED_CONGESTED:
        {
            NRF_LOG_INFO("Register message was rejected. Reason: congestion.\r\n");

            uint32_t fifo_dequeue_rc = mqttsn_packet_fifo_elem_dequeue(p_client, packet_id, MQTTSN_MESSAGE_ID);
            ASSERT(fifo_dequeue_rc == NRF_SUCCESS);

            mqttsn_event_t evt_rc;
            memset(&evt_rc, 0, sizeof(mqttsn_event_t)); 
            evt_rc.event_id                  = MQTTSN_EVENT_TIMEOUT;
            evt_rc.event_data.error.error    = MQTTSN_ERROR_REJECTED_CONGESTION;
            evt_rc.event_data.error.msg_type = mqttsn_packet_msgtype_error_get(p_data);
            evt_rc.event_data.error.msg_id   = 0;

            p_client->evt_handler(p_client, &evt_rc);

            return NRF_SUCCESS;
        }

        case MQTTSN_RC_ACCEPTED:
        {
            if (mqttsn_packet_fifo_elem_find(p_client, packet_id, MQTTSN_MESSAGE_ID) ==
                MQTTSN_PACKET_FIFO_MAX_LENGTH)
            {
                NRF_LOG_ERROR("SUBACK packet ID has unexpected value.\r\n");
                return NRF_ERROR_INTERNAL;
            }
    
            uint32_t fifo_dequeue_rc = mqttsn_packet_fifo_elem_dequeue(p_client, packet_id, MQTTSN_MESSAGE_ID);
            ASSERT(fifo_dequeue_rc == NRF_SUCCESS);

            mqttsn_event_t evt_acc =
            {
                .event_id = MQTTSN_EVENT_SUBSCRIBED
            };

            p_client->evt_handler(p_client, &evt_acc);

            return NRF_SUCCESS;
        }

        default:
            NRF_LOG_ERROR("Subscribe message was rejected. Reason: %d\r\n", return_code);
            return NRF_ERROR_INTERNAL;
            
    }
}

/**@brief Handles UNSUBACK message received from the gateway.  
 *
 * @param[inout] p_client    Pointer to an MQTT-SN client instance. 
 * @param[in]    p_data      Received data.
 * @param[in]    datalen     Length of the received data.
 *
 * @retval       NRF_SUCCESS        If UNSUBACK message was processed successfully.
 * @retval       NRF_ERROR_INTERNAL Otherwise.
 */
static uint32_t unsuback_handle(mqttsn_client_t * p_client,
                                const uint8_t   * p_data,
                                uint16_t          datalen)
{
    uint16_t packet_id = 0;

    if (MQTTSNDeserialize_unsuback(&packet_id, (unsigned char *)p_data, datalen) == 0)
    {
        NRF_LOG_ERROR("UNSUBACK packet cannot be deserialized.\r\n");
        return NRF_ERROR_INTERNAL;
    }

    if (mqttsn_packet_fifo_elem_find(p_client, packet_id, MQTTSN_MESSAGE_ID) ==
        MQTTSN_PACKET_FIFO_MAX_LENGTH)
    {
        NRF_LOG_ERROR("UNSUBACK packet ID has unexpected value\r\n");
        return NRF_ERROR_INTERNAL;
    }

    uint32_t fifo_dequeue_rc = mqttsn_packet_fifo_elem_dequeue(p_client, packet_id, MQTTSN_MESSAGE_ID);
    ASSERT(fifo_dequeue_rc == NRF_SUCCESS);

    mqttsn_event_t evt =
    {
        .event_id = MQTTSN_EVENT_UNSUBSCRIBED
    };

    p_client->evt_handler(p_client, &evt);

    return NRF_SUCCESS;
}

/**@brief Handles PINGRESP message received from the gateway. 
 *
 * @param[inout] p_client    Pointer to an MQTT-SN client instance.
 *
 * @retval       NRF_SUCCESS In all cases.
 */
static uint32_t pingresp_handle(mqttsn_client_t * p_client)
{
    if (p_client->keep_alive.response_arrived == 0)
    {
        p_client->keep_alive.message.retransmission_cnt = MQTTSN_DEFAULT_RETRANSMISSION_CNT + 1;
        p_client->keep_alive.response_arrived           = 1;
        p_client->keep_alive.timeout                    =
            mqttsn_platform_timer_set_in_ms(p_client->keep_alive.duration);

        mqttsn_client_state_update(p_client, RECEIVED_PINGRESP);

        if (p_client->client_state == MQTTSN_CLIENT_ASLEEP)
        {
            mqttsn_event_t evt =
            {
                .event_id = MQTTSN_EVENT_SLEEP_PERMIT
            };
            p_client->evt_handler(p_client, &evt);
        }
    }

    return NRF_SUCCESS;
}

/**@brief Handles DISCONNECT message received from the gateway. 
 *
 * @param[inout] p_client    Pointer to an MQTT-SN client instance.
 *
 * @retval       NRF_SUCCESS If the message is a response to a DISCONNECT message sent by the
 *                           gateway or if CONNECT message is sent successfully in the opposite case.
 * @retval       Otherwise, error code is returned.
 */
static uint32_t disconnect_handle(mqttsn_client_t * p_client)
{
    switch (p_client->client_state)
    {
        case MQTTSN_CLIENT_WAITING_FOR_DISCONNECT:
        {
            uint32_t fifo_dequeue_rc = mqttsn_packet_fifo_elem_dequeue(p_client,
                                                                       MQTTSN_MSGTYPE_DISCONNECT,
                                                                       MQTTSN_MESSAGE_TYPE);
            ASSERT(fifo_dequeue_rc == NRF_SUCCESS);

            uint32_t timer_stop_rc = mqttsn_platform_timer_stop();
            ASSERT(timer_stop_rc == NRF_SUCCESS);

            mqttsn_client_state_update(p_client, RECEIVED_DISCONNECT_PERMISSION);

