hetida4office/hetida4office/edge/co2sensor/firmware/nRF5_SDK_for_Thread_and_Zigbee_v4.1.0_32ce5f8/components/thread/mqtt_sn/mqtt_sn_client/mqttsn_packet_receiver.c
            mqttsn_event_t evt =
            {
                .event_id = MQTTSN_EVENT_DISCONNECT_PERMIT
            };
            p_client->evt_handler(p_client, &evt);

            return NRF_SUCCESS;
        }

        case MQTTSN_CLIENT_WAITING_FOR_SLEEP:
        {
            uint32_t fifo_dequeue_rc = mqttsn_packet_fifo_elem_dequeue(p_client,
                                                                       MQTTSN_MSGTYPE_DISCONNECT,
                                                                       MQTTSN_MESSAGE_TYPE);
            ASSERT(fifo_dequeue_rc == NRF_SUCCESS);

            p_client->keep_alive.timeout =
                mqttsn_platform_timer_set_in_ms(p_client->keep_alive.duration);

            mqttsn_client_state_update(p_client, RECEIVED_SLEEP_PERMISSION);
 
            mqttsn_event_t evt =
            {
                .event_id = MQTTSN_EVENT_SLEEP_PERMIT
            };
            p_client->evt_handler(p_client, &evt);

            return NRF_SUCCESS;
        }

        default:
        {
            mqttsn_client_state_update(p_client, RECEIVED_DISCONNECT);

            mqttsn_event_t evt =
            {
                .event_id = MQTTSN_EVENT_DISCONNECTED
            };
            p_client->evt_handler(p_client, &evt);

            return NRF_SUCCESS;
        }
    }
}

/**@brief Handles WILLTOPICRESP message received from the gateway.  
 *
 * @param[inout] p_client    Pointer to an MQTT-SN client instance. 
 * @param[in]    p_data      Received data.
 * @param[in]    datalen     Length of the received data.
 *
 * @retval       NRF_SUCCESS        If WILLTOPICRESP message was accepted or rejected due to congestion
 *                                  and processed successfully.
 * @retval       NRF_ERROR_INTERNAL Otherwise.
 */
static uint32_t willtopicresp_handle(mqttsn_client_t * p_client,
                                     const uint8_t   * p_data,
                                     uint16_t          datalen)
{
    uint32_t return_code = 0;
    if (MQTTSNDeserialize_willtopicresp((int *)(&return_code), (unsigned char *)p_data, datalen) == 0)
    {
        NRF_LOG_ERROR("WILLTOPICRESP packet cannot be deserialized.\r\n");
        return NRF_ERROR_INTERNAL;
    }

    switch (return_code)
    {
        case MQTTSN_RC_REJECTED_CONGESTED:
        {
            NRF_LOG_INFO("WILLTOPICUPD message was rejected. Reason: congestion.\r\n");

            mqttsn_event_t evt_rc;
            memset(&evt_rc, 0, sizeof(mqttsn_event_t)); 
            evt_rc.event_id                  = MQTTSN_EVENT_TIMEOUT;
            evt_rc.event_data.error.error    = MQTTSN_ERROR_REJECTED_CONGESTION;
            evt_rc.event_data.error.msg_type = mqttsn_packet_msgtype_error_get(p_data);
            evt_rc.event_data.error.msg_id   = 0;
            
            uint32_t fifo_dequeue_rc = mqttsn_packet_fifo_elem_dequeue(p_client,
                                                                       MQTTSN_MSGTYPE_WILLTOPICUPD,
                                                                       MQTTSN_MESSAGE_TYPE);
            ASSERT(fifo_dequeue_rc == NRF_SUCCESS);
            p_client->evt_handler(p_client, &evt_rc);

            return NRF_SUCCESS;
        }

        case MQTTSN_RC_ACCEPTED:
        {
            uint32_t fifo_dequeue_rc = mqttsn_packet_fifo_elem_dequeue(p_client,
                                                                       MQTTSN_MSGTYPE_WILLTOPICUPD,
                                                                       MQTTSN_MESSAGE_TYPE);
            ASSERT(fifo_dequeue_rc == NRF_SUCCESS);

            mqttsn_event_t evt_acc =
            {
                .event_id = MQTTSN_EVENT_WILL_TOPIC_UPD
            };
            p_client->evt_handler(p_client, &evt_acc);

            return NRF_SUCCESS;
        }

        default:
            NRF_LOG_ERROR("WILLTOPICUPD message was rejected. Reason: %d\r\n", return_code);
            return NRF_ERROR_INTERNAL;
    }
}

/**@brief Handles WILLMSGRESP message received from the gateway.  
 *
 * @param[inout] p_client    Pointer to an MQTT-SN client instance. 
 * @param[in]    p_data      Received data.
 * @param[in]    datalen     Length of the received data.
 *
 * @retval       NRF_SUCCESS        If WILLMSGRESP message was accepted or rejected due to congestion
 *                                  and processed successfully.
 * @retval       NRF_ERROR_INTERNAL Otherwise.
 */
static uint32_t willmsgresp_handle(mqttsn_client_t * p_client,
                                   const uint8_t   * p_data,
                                   uint16_t          datalen)
{
    uint32_t return_code = 0;
    if (MQTTSNDeserialize_willmsgresp((int *)(&return_code), (unsigned char *)p_data, datalen) == 0)
    {
        NRF_LOG_ERROR("WILLTOPICRESP packet cannot be deserialized.\r\n");
        return NRF_ERROR_INTERNAL;
    }

    switch (return_code)
    {
        case MQTTSN_RC_REJECTED_CONGESTED:
        {
            NRF_LOG_INFO("WILLTOPICUPD message was rejected. Reason: congestion.\r\n");
            
            mqttsn_event_t evt_rc;
            memset(&evt_rc, 0, sizeof(mqttsn_event_t)); 
            evt_rc.event_id                  = MQTTSN_EVENT_TIMEOUT;
            evt_rc.event_data.error.error    = MQTTSN_ERROR_REJECTED_CONGESTION;
            evt_rc.event_data.error.msg_type = mqttsn_packet_msgtype_error_get(p_data);
            evt_rc.event_data.error.msg_id   = 0;

            uint32_t fifo_dequeue_rc = mqttsn_packet_fifo_elem_dequeue(p_client,
                                                                       MQTTSN_MSGTYPE_WILLMSGUPD,
                                                                       MQTTSN_MESSAGE_TYPE);
            ASSERT(fifo_dequeue_rc == NRF_SUCCESS);
            p_client->evt_handler(p_client, &evt_rc);

            return NRF_SUCCESS;
        }

        case MQTTSN_RC_ACCEPTED:
        {
            uint32_t fifo_dequeue_rc = mqttsn_packet_fifo_elem_dequeue(p_client,
                                                                       MQTTSN_MSGTYPE_WILLMSGUPD,
                                                                       MQTTSN_MESSAGE_TYPE);
            ASSERT(fifo_dequeue_rc == NRF_SUCCESS);

            mqttsn_event_t evt_acc =
            {
                .event_id = MQTTSN_EVENT_WILL_MSG_UPD
            };
            p_client->evt_handler(p_client, &evt_acc);

            return NRF_SUCCESS;
        }

        default:
            NRF_LOG_ERROR("WILLTOPICUPD message was rejected. Reason: %d\r\n", return_code);
            return NRF_ERROR_INTERNAL;
    }
}

/**@brief Handles message received from the gateway.  
 *
 * @param[inout] p_client     Pointer to an MQTT-SN client instance.
 * @param[in]    p_port       Pointer to local port that received the message.
 * @param[in]    p_remote     Pointer to remote endpoint.
 * @param[in]    p_data       Received data.
 * @param[in]    datalen      Length of the received data.
 * @param[in]    message_type Message Type field value.
 *
 * @retval       NRF_SUCCESS             If message is processed successfully.
 * @retval       NRF_ERROR_NOT_SUPPORTED If message of unsupported type has been received.
 * @retval       Otherwise, appropriate error code is returned.
 */
static uint32_t message_handle(mqttsn_client_t        * p_client,
                               const mqttsn_port_t    * p_port,
                               const mqttsn_remote_t  * p_remote,
                               const uint8_t          * p_data,
                               uint16_t                 datalen,
                               MQTTSN_msgTypes          message_type)
{
    uint32_t err_code = NRF_ERROR_INVALID_STATE;

