hetida4office/hetida4office/edge/co2sensor/firmware/nRF5_SDK_for_Thread_and_Zigbee_v4.1.0_32ce5f8/components/thread/mqtt_sn/mqtt_sn_client/mqttsn_packet_receiver.c
    // TODO: If we are in the AWAKE state then we have to restart the PINGREQ timeout timer
    // whenever a package other than PINGRESP is received.

    switch(message_type)
    {
        case MQTTSN_ADVERTISE:
            break;

        case MQTTSN_GWINFO:
            err_code = gwinfo_handle(p_client, p_remote, p_data, datalen);
            break;

        case MQTTSN_WILLTOPICREQ:
            err_code = willtopicreq_handle(p_client);
            break;

        case MQTTSN_WILLMSGREQ:
            err_code = willmsgreq_handle(p_client);
            break;

        case MQTTSN_CONNACK:
            err_code = connack_handle(p_client, p_data, datalen);
            break;

        case MQTTSN_REGISTER:
            err_code = register_handle(p_client, p_data, datalen);
            break;

        case MQTTSN_REGACK:
            err_code = regack_handle(p_client, p_data, datalen);
            break;

        case MQTTSN_PUBLISH:
            err_code = publish_handle(p_client, p_data, datalen);
            break;

        case MQTTSN_PUBACK:
            err_code = puback_handle(p_client, p_data, datalen);
            break;

        case MQTTSN_SUBACK:
            err_code = suback_handle(p_client, p_data, datalen);
            break;
        
        case MQTTSN_UNSUBACK:
            err_code = unsuback_handle(p_client, p_data, datalen);
            break;

        case MQTTSN_PINGRESP:
            err_code = pingresp_handle(p_client);
            break;

        case MQTTSN_DISCONNECT:
            err_code = disconnect_handle(p_client);
            break;

        case MQTTSN_WILLTOPICRESP:
            err_code = willtopicresp_handle(p_client, p_data, datalen);
            break;

        case MQTTSN_WILLMSGRESP:
            err_code = willmsgresp_handle(p_client, p_data, datalen);
            break;

        default:
            err_code = NRF_ERROR_NOT_SUPPORTED;
            NRF_LOG_ERROR("Message of unsupported type has been received.\r\n");
            break;
    }

    return err_code;
}

uint32_t mqttsn_packet_receiver(mqttsn_client_t        * p_client,
                                const mqttsn_port_t    * p_port,
                                const mqttsn_remote_t  * p_remote,
                                const uint8_t          * p_data,
                                uint16_t                 datalen)
{
    MQTTSN_msgTypes msg_type = (MQTTSN_msgTypes)p_data[mqttsn_packet_msgtype_index_get(p_data)];
    return message_handle(p_client, p_port, p_remote, p_data, datalen, msg_type);
}
